---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundaryError
source: html/b39359be-fc00-e8e2-00f1-ed65f6b76bf1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundaryError Property

Stairs require no less than two boundaries (chains of one or more Boundary Lines).

## Syntax (C#)
```csharp
public static FailureDefinitionId StairOnlyOneConnectedBoundaryError { get; }
```